{
  "patterns": [
    {
      "id": "k-001",
      "type": "knit",
      "title": "Plaited Throw",
      "creator": "Purl Soho",
      "sourceURL": "https://www.purlsoho.com/create/2017/01/13/plaited-throw/",
      "materials": [
        {
          "yarn": {
            "name": "Linen Quill",
            "content": "50% Fine Highland Wool, 35% Alpaca, and 15% Linen",
            "weight": "100 grams",
            "length": "439 yards",
            "gauge": "6.5 - 7.5 stitches per inch",
            "suggestedNeedle": "US 2 - 5 (3 - 3.75 mm)",
            "suggestedCrochetHook": "C - E (2.75 - 3.5 mm)",
            "recommendedCare": "Hand wash and lay flat to dry",
            "link": "https://www.purlsoho.com/linen-quill.html",
            "skeinCount": 6,
            "notes": null
          }
        },
        {
          "tools": [
            "US 11, 32-inch circular knitting needles"
          ]
        }
      ],
      "gauge": {
        "description": "22 stitches = 4 inches in the stitch pattern"
      },
      "size": {
        "description": "Finished Dimensions: Approximately 38 inches wide x 48 inches long"
      },
      "notes": {
        "description": "For this pattern you’ll use the Linen Quill doubled. To do that, just pull a strand from two balls of yarn! There are lots of variations on woven or plaited stitches. Here’s how we do this one... Row 1 (right side): *Insert the right needle through the back loop of the second stitch on the left needle. Wrap the yarn counterclockwise around the right needle and knit a stitch, but do not remove the second stitch from the left needle. Then, knit the first stitch on the needle as usual, and allow both stitches to fall off the left needle, repeat from * to end row. Row 2 (wrong side): Purl 1 stitch, then… *purl the second stitch on the left needle by inserting the right needle through the front loop and purling a stitch. Do not remove the second stitch from the left needle. Then, purl the first stitch on the needle as usual, and allow both stitches to fall off the left needle, repeat from * to end of row. NOTE: If you want to change the sizing or use this stitch pattern for a different project, cast on a multiple of 2 stitches."
      },
      "pattern": {
        "description": "Loosely cast on 210 stitches, with yarn held doubled (see Notes, above). Row 1 (right side): *Knit second stitch on left needle through the back loop without removing stitch from needle, then knit the first stitch, slipping both stitches from needle, repeat from * to end of row. Row 2 (wrong side): P1, *purl second stitch on left needle without removing stitch from needle, then purl the first stitch, slipping both stitches from needle, repeat from * to last stitch, p1. Repeat Rows 1 and 2 until piece measures 48 inches from cast-on edge, ending with Row 2. Bind off all stitches knitwise. Weave in ends and block if desired!"
      }
    },
    {
      "id": "k-002",
      "type": "knit",
      "title": "Lattice Brioche Scarf",
      "creator": "Purl Soho",
      "sourceURL": "https://www.purlsoho.com/create/2016/11/04/lattice-brioche-scarf/",
      "materials": [
        {
          "yarn": {
            "name": "Gentle Giant",
            "content": "100% Merino Wool",
            "weight": "125 grams",
            "length": "48 yards",
            "gauge": "1.5 - 2 stitches per inch",
            "suggestedNeedle": "US 17 or 19 (12 - 15 mm)",
            "suggestedCrochetHook": "P or Q (11.5 - 15.75 mm)",
            "recommendedCare": "Hand wash and lay flat to dry",
            "link": "https://www.purlsoho.com/yarn/gentle-giant.html",
            "skeinCount": 4,
            "notes": null
          }
        },
        {
          "tools": [
            "US 17 straight or circular needles"
          ]
        }
      ],
      "gauge": {
        "description": "4 1/2 stitches = 4 inches in stitch pattern"
      },
      "size": {
        "description": "Finished Dimensions: 8 inches wide x 84 inches long"
      },
      "notes": {
        "description": "ABBREVIATIONS: Slip 1: Slip 1 purlwise with yarn in front. Slip 1, yo (slip 1, yarn over): Bring yarn to front of work, slip 1 stitch purlwise, bring the working yarn over the right-hand needle to the back of the work so the yarn is lying on top of the slipped stitch. Slip 1, dyo (slip 1, double yarn over): Bring yarn to front of work, slip 1 stitch purlwise together with the yarn over from the previous row, bring the working yarn over the right-hand needle to the back of the work so the yarn is lying on top of the slipped stitch and first yarn over. bk3tog (brioche knit 3 together): Knit next knit stitch together with both of its paired yarn overs, i.e. knit 1 stitch together with 2 yarn overs. TIP: When you place yarn overs and double yarn overs on the second stitch in Rows 1 and 2, be careful to not work the yarn overs too tightly so that you get a nice and even selvage!"
      },
      "pattern": {
        "description": "Loosely cast on 11 stitches. Set-Up Row 1 (wrong side): Slip 1 (see Notes), *k1, slip 1, yo (see Notes), repeat from * to last 2 stitches, k2. Set-Up Row 2 (right side): Slip 1, *k1, slip 1, dyo (see Notes), repeat from * to last 2 stitches, k2. Row 1 (wrong side): Slip 1, *slip 1, yo, bk3tog (see Notes), repeat from * to last 2 stitches, slip 1, yo, k1. Row 2 (right side): Slip 1, *slip 1, dyo, k1, repeat from * to last 2 stitches, slip 1, dyo, k1. Row 3: Slip 1, *bk3tog, slip 1, yo, repeat from * to last 2 stitches (not including yarn overs), bk3tog, k1. Row 4: Slip 1, *k1, slip 1, dyo, repeat from * to last 2 stitches, k2. Repeat Rows 1-4 until piece measures desired length or until you have used nearly all 4 skeins, ending with Row 1. Be sure to leave enough yarn to bind off. With the right side facing you, loosely bind of knitwise. Weave in the ends and block, if desired. (I recommend lightly steaming your scarf to relax the yarn into the stitch pattern. A full wet blocking might be a little unruly!)"
      }
    },
    {
      "id": "c-001",
      "type": "crochet",
      "title": "Crochet Four Points Baby Blanket",
      "creator": "Purl Soho",
      "sourceURL": "https://www.purlsoho.com/create/2016/03/31/crochet-four-points-baby-blanket/",
      "materials": [
        {
          "yarn": {
            "name": "Linen Quill",
            "content": "50% Fine Highland Wool, 35% Alpaca, and 15% Linen",
            "weight": "100 grams",
            "length": "439 yards",
            "gauge": "6.5 - 7.5 stitches per inch",
            "suggestedNeedle": "US 2 - 5 (3 - 3.75 mm)",
            "suggestedCrochetHook": "C - E (2.75 - 3.5 mm)",
            "recommendedCare": "Hand wash and lay flat to dry",
            "link": "https://www.purlsoho.com/linen-quill.html",
            "skeinCount": 4,
            "notes": null
          }
        },
        {
          "tools": [
            "A size D (3.25mm) crochet hook"
          ]
        }
      ],
      "gauge": {
        "description": "21 stitches = 4 inches in single crochet"
      },
      "size": {
        "description": "Finished Dimensions: Approximately 36 x 36 inches"
      },
      "notes": {
        "description": null
      }
      ,
      "pattern": {
        "description": "TRIANGLE 1: (IF YOU ARE A BEGINNER CROCHETER...  With Color A, chain 143. Foundation Row 1: Starting with second chain from hook, make 1 single crochet into each chain stitch, chain 1, and turn work. [142 stitches] IF YOU ARE A MORE EXPERIENCED CROCHETER...  With Color A, make a Foundation Single Crochet of 142 stitches. EVERYONE...  Row 1 (wrong side): Make 1 single crochet (sc) into each stitch to last 2 stitches, 1 sc dec (see Notes, above), chain 1, and turn. [1 stitch decreased] Row 2 (right side): 1 sc dec, make 1 sc into each stitch to end of row, chain 1, and turn. [1 stitch decreased] (Note: To help you keep track, you may want to mark the right side of the fabric with a removable stitch marker or piece of scrap yarn.) Repeat Rows 1 and 2 until one stitch remains. Cut yarn and pull through remaining loop. TRIANGLE 2: With the wrong side facing you and starting at the right end of the foundation edge, join Color B and make 1 sc in each stitch along the foundation edge, chain 1, and turn. [142 stitches] As with Triangle 1, work Rows 1 and 2 until you have one stitch left. Cut yarn and pull through remaining loop. Set aside Triangles 1 and 2 for now. TRIANGLES 3 + 4: Repeat the instructions for Triangles 1 and 2 to create Triangles 3 and 4. Make Triangle 3 with Color C and Triangle 4 with Color D. JOIN TRIANGLES 1 + 2 WITH TRIANGLES 3 + 4 Note: Now is a good time to lightly steam or wet block both pieces. Shape each into a neat right angle triangle. With the right sides facing up, align the two finished pieces along the edges that are half one color and half another color, so that Triangle 1 abuts Triangle 3 and Triangle 2 abuts Triangle 4. Thread a tapestry needle with Color A and using a whipstitch, join the edge of Triangle 1 to the edge of Triangle 3. Using Color B, join the edge of Triangle 2 to the edge of Triangle 4 in the same way. FINISH: Weave in ends and block again, if desired."
      }
    },
    {
      "id": "c-002",
      "type": "crochet",
      "title": "Crocheted Super Easy Baby Blanket",
      "creator": "Purl Soho",
      "sourceURL": "https://www.purlsoho.com/create/2014/11/07/crocheted-super-easy-baby-blanket/",
      "materials": [
        {
          "yarn": {
            "name": "Worsted Twist",
            "content": "100% Merino Wool",
            "weight": "100 grams",
            "length": "164 yards",
            "gauge": "4.5 - 5 stitches per inch",
            "suggestedNeedle": "US 7 - 8 (4.5 - 5 mm)",
            "suggestedCrochetHook": "G - H (4.5 - 5 mm)",
            "recommendedCare": "Hand wash",
            "link": "https://www.purlsoho.com/yarn/knitting-crochet/worsted-twist.html",
            "skeinCount": 7,
            "notes": null
          }
        },
        {
          "tools": [
            "Size I crochet hook"
          ]
        }
      ],
      "gauge": {
        "description": "15 single crochets = 4 inches"
      },
      "size": {
        "description": "Finished Dimensions: 27 3/4 wide x 38 1/2 inches long"
      },
      "notes": {
        "description": null
      },
      "pattern": {
        "description": "IF YOU ARE A BEGINNER CROCHETER...  With the first color in your color sequence, chain 105. Foundation Row: Starting with second chain from hook, make 1 single crochet into each chain. (104 stitches) IF YOU ARE A MORE EXPERIENCED CROCHETER... With the first color in your color sequence, make a Foundation Single Crochet of 104 stitches. (If you haven’t tried this technique, it’s well worth learning! Check out our Foundation Single Crochet Tutorial) EVERYONE... Row 1: Turn the work. Make 1 single crochet into each stitch. (104 stitches) Repeat Row 1 until piece measures about 5 1/2 inches from the chain edge or until the skein nearly runs out. (Note that it takes about 6-7 yards of yarn to work one row.) Join the next color in the sequence. Repeat Row 1 until this stripe measures the same as the first stripe, making sure to end on the same side you finished the first skein. In other words, all of the tails (except perhaps, the beginning chain tail) will be along the same selvage. The first row of every color will be on the “right side” of the blanket, and you will end each color on the “wrong side”. CONTINUING... *Join the next color in the sequence. Repeat Row 1 until this stripe measures the same as the others, ending with a wrong side row. Repeat from * working through the entire sequence of seven skeins. Pull the end of the final skein through the remaining stitch and weave in any ends you didn’t already crochet over. All done!"
      }
    }
  ]
}